# Common table expressions

Using the northwind database

## 1. Write a CTE that lists the names and quantities of products with a unit price greater than $50.

```sql
-- Your code down below

```

In [1]:
import pymysql

In [4]:
import sqlalchemy as alch # bash: conda activate ironhack; python -m pip install --upgrade 'sqlalchemy<2.0'
                                                        # pip install SQLAlchemy
from getpass import getpass
import pandas as pd
import os
password = getpass()
dbName = "northwind"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData) #publications

········

In [5]:
query = ''' WITH ExpensiveProducts AS (
    SELECT ProductName, Unit
    FROM Products
    WHERE price > 50
)

SELECT ProductName, Unit
FROM ExpensiveProducts;

'''
pd.read_sql_query(query, engine)

               ProductName                  Unit
0          Mishi Kobe Niku      18 - 500 g pkgs.
1         Carnarvon Tigers            16 kg pkg.
2   Sir Rodney's Marmalade         30 gift boxes
3  Thüringer Rostbratwurst  50 bags x 30 sausgs.
4            Côte de Blaye    12 - 75 cl bottles
5    Manjimup Dried Apples      50 - 300 g pkgs.
6     Raclette Courdavault             5 kg pkg.

#### Expected results

|ProductName                     |Unit|
|--------------------------------|----|
|Mishi Kobe Niku                 |18 - 500 g pkgs.|
|Carnarvon Tigers                |16 kg pkg.|
|Sir Rodney's Marmalade          |30 gift boxes|
|Thüringer Rostbratwurst         |50 bags x 30 sausgs.|
|Côte de Blaye                   |12 - 75 cl bottles|
|Manjimup Dried Apples           |50 - 300 g pkgs.|
|Raclette Courdavault            |5 kg pkg.|

## 2. What are the top 5 most profitable products?

```sql
-- Your code down below
```

#### Expected results
Alice Mutton is 6th

|ProductID                       |ProductName|TotalRevenue|
|--------------------------------|-----------|------------|
|-                             |-|-       |
|-                           |-|-       |
|-                            |-|-       |
|-                             |-|-       |
|-                              |-|-       |
|17                              |Alice Mutton|12909       |

In [6]:
query = ''' WITH profitable_products as (
    SELECT Products.ProductID, Products.ProductName, SUM(OrderDetails.Quantity * Products.Price) AS TotalRevenue
    FROM OrderDetails 
    JOIN Products ON OrderDetails.ProductID = Products.ProductID
    GROUP BY Products.ProductID, Products.ProductName, Products.Price
)
SELECT ProductID, ProductName, TotalRevenue
FROM profitable_products
ORDER BY TotalRevenue DESC
LIMIT 6;

'''
pd.read_sql_query(query, engine)

   ProductID              ProductName  TotalRevenue
0         38            Côte de Blaye       63096.0
1         29  Thüringer Rostbratwurst       20832.0
2         59     Raclette Courdavault       19030.0
3         62           Tarte au sucre       15925.0
4         60        Camembert Pierrot       14620.0
5         17             Alice Mutton       12909.0

## 3. Write a CTE that lists the top 5 categories by the number of products they have.

```sql
-- Your code down below
```

#### Expected result
|CategoryName                    |ProductCount|
|--------------------------------|------------|
|Confections                     |13          |
|Beverages                       |12          |
|Condiments                      |12          |
|Seafood                         |12          |
|Dairy Products                  |10          |

In [7]:
query = ''' WITH top_categories as (
        SELECT Categories.CategoryName, COUNT(Products.ProductID) as ProductCount
        from products
        JOIN Categories on Products.CategoryID = Categories.CategoryID
        group by Categories.CategoryName
)
SELECT CategoryName, ProductCount
FROM top_categories
ORDER BY ProductCount DESC
LIMIT 5;

'''
pd.read_sql_query(query, engine)

     CategoryName  ProductCount
0     Confections            13
1       Beverages            12
2      Condiments            12
3         Seafood            12
4  Dairy Products            10

## 4. Write a CTE that shows the average order quantity for each product category.

```sql
-- Your code down below

```

|CategoryName                    |AvgOrderQuantity|
|--------------------------------|----------------|
|Beverages                       |24.6129         |
|Condiments                      |28.2245         |
|Confections                     |25.1190         |
|Dairy Products                  |26.0100         |
|Grains/Cereals                  |21.7143         |
|Meat/Poultry                    |25.7600         |
|Produce                         |21.6667         |
|Seafood                         |21.5672         |

In [8]:
query = ''' WITH av_order_quantity as (
        SELECT CategoryName, AVG(OrderDetails.Quantity) as AvgOrderQuantity
        from Categories
        JOIN Products on Categories.CategoryID = Products.CategoryID
        JOIN OrderDetails on Products.ProductID = OrderDetails.ProductID
        group by Categories.CategoryName
)
SELECT CategoryName, AvgOrderQuantity
FROM av_order_quantity
ORDER BY CategoryName;

'''
pd.read_sql_query(query, engine)

     CategoryName  AvgOrderQuantity
0       Beverages           24.6129
1      Condiments           28.2245
2     Confections           25.1190
3  Dairy Products           26.0100
4  Grains/Cereals           21.7143
5    Meat/Poultry           25.7600
6         Produce           21.6667
7         Seafood           21.5672

# 5. Create a CTE to calculate the average order amount for each customer.

```sql
-- Your code down below


```

|CustomerID                      |CustomerName|AvgOrderAmount|
|--------------------------------|------------|--------------|
|59                              |Piccolo und mehr|4014.2500     |
|73                              |Simons bistro|2444.3333     |
|62                              |Queen Cozinha|1991.6667     |
|51                              |Mère Paillarde|1673.8571     |
|71                              |Save-a-lot Markets|1407.2500     |
|76                              |Suprêmes délices|1345.8333     |
|81                              |Tradição Hipermercados|1315.6667     |
|7                               |Blondel père et fils|1174.4615     |
|89                              |White Clover Markets|1112.5000     |
|55                              |Old World Delicatessen|1079.5000     |
|20                              |Ernst Handel|1018.0000     |
|19                              |Eastern Connection|1004.8000     |
|68                              |Richter Supermarkt|976.6667      |
|72                              |Seven Seas Imports|934.0000      |
|63                              |QUICK-Stop  |908.5500      |
|25                              |Frankenversand|895.0667      |
|75                              |Split Rail Beer & Ale|854.7692      |
|65                              |Rattlesnake Canyon Grocery|838.2727      |
|52                              |Morgenstern Gesundkost|754.0000      |
|9                               |Bon app''   |750.4286      |
|37                              |Hungry Owl All-Night Grocers|733.5714      |
|35                              |HILARIÓN-Abastos|722.8333      |
|33                              |GROSELLA-Restaurante|690.0000      |
|34                              |Hanari Carnes|681.0000      |
|15                              |Comércio Mineiro|677.5000      |
|23                              |Folies gourmandes|672.3333      |
|10                              |Bottom-Dollar Marketse|664.0000      |
|31                              |Gourmet Lanchonetes|641.0000      |
|60                              |Princesa Isabel Vinhoss|628.5000      |
|5                               |Berglunds snabbköp|601.5556      |
|46                              |LILA-Supermercado|564.7692      |
|44                              |Lehmanns Marktstand|545.7500      |
|30                              |Godos Cocina Típica|515.0000      |
|3                               |Antonio Moreno Taquería|504.0000      |
|88                              |Wellington Importadora|503.8333      |
|47                              |LINO-Delicateses|500.0000      |
|56                              |Ottilies Käseladen|500.0000      |
|87                              |Wartian Herkku|492.5833      |
|24                              |Folk och fä HB|480.2222      |
|49                              |Magazzini Alimentari Riuniti|464.2857      |
|86                              |Die Wandernde Kuh|441.9091      |
|41                              |La maison d''Asie|437.8182      |
|8                               |Bólido Comidas preparadas|416.0000      |
|83                              |Vaffeljernet|411.0000      |
|14                              |Chop-suey Chinese|374.8333      |
|80                              |Tortuga Restaurante|357.4167      |

In [9]:
query = ''' WITH av_order_customer as (
        SELECT Customers.CustomerID, Customers.CustomerName, AVG(OrderDetails.Quantity * Products.Price) AS AvgOrderAmount
        from Customers
        JOIN Orders on Customers.CustomerID = Orders.CustomerID
        JOIN OrderDetails on Orders.OrderID = OrderDetails.OrderID
        JOIN Products on OrderDetails.ProductID = Products.ProductID
        group by CustomerID, CustomerName       
      
)
SELECT CustomerID, CustomerName, AvgOrderAmount
FROM av_order_customer
ORDER BY AvgOrderAmount DESC;

'''
pd.read_sql_query(query, engine)

    CustomerID                        CustomerName  AvgOrderAmount
0           59                    Piccolo und mehr       4014.2500
1           73                       Simons bistro       2444.3333
2           62                       Queen Cozinha       1991.6667
3           51                      Mère Paillarde       1673.8571
4           71                  Save-a-lot Markets       1407.2500
..         ...                                 ...             ...
69          29              Galería del gastrónomo        147.7500
70          69                    Romero y tomillo        116.5000
71          13          Centro comercial Moctezuma         63.0000
72          27                      Franchi S.p.A.         62.0000
73           2  Ana Trujillo Emparedados y helados         55.5000

[74 rows x 3 columns]

# 6. Sales Analysis with CTEs

Assume we have the Northwind database which contains tables like Orders, OrderDetails, and Products. Create a CTE that calculates the total sales for each product in the year 1997.

```sql
-- Your code down below

 ```

#### Expected result

|ProductName                     |TotalSales|
|--------------------------------|----------|
|Gnocchi di nonna Alice          |173       |
|Tourtière                       |126       |
|Geitost                         |119       |
|Chang                           |115       |
|Raclette Courdavault            |115       |
|Sirop d'érable                  |106       |
|Vegie-spread                    |100       |
|Côte de Blaye                   |99        |
|Alice Mutton                    |97        |
|Steeleye Stout                  |95        |
|Sir Rodney's Scones             |92        |
|Pavlova                         |86        |
|Zaanse koeken                   |85        |
|Fløtemysost                     |75        |
|Tarte au sucre                  |75        |